trade/src/Documents/ЗаявкаНаОбеспечение/ЗаявкаНаОбеспечение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОбеспечение</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>EnumRef.ВидыЗаявкиНаОбеспечение</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийФайл</name>
    <type>
      <types>CatalogRef.НастройкиРабочегоФайла</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбеспечение</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорийныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ТипПотребности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассТовара</name>
      <type>
        <types>EnumRef.ABCКлассификация_Альтерра</types>
      </type>
    </attributes>
    <attributes>
      <name>Ликвидность</name>
      <type>
        <types>EnumRef.Ликвидность</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодОбеспечения</name>
      <type>
        <types>EnumRef.МетодыОбеспеченияПотребностей</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйЗапас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйЗапас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчета</name>
      <type>
        <types>CatalogRef.оп_АлгоритмыОбеспеченияПотребностей</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспечения</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОптовыеСклады</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничныеСклады</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказыКПоступлению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КЗаказу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КЗаказуРучной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрендПараметр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрендПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Периоды</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыРасход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/Documents/ЗаявкаНаОбеспечение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//не используемые	
Функция ТаблицаТоваровДляЗаказа(Заявка)экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаОбеспечениеТовары.Номенклатура КАК Номенклатура,
		|	ЗаявкаНаОбеспечениеТовары.КЗаказу КАК Количество,
		|	ЗаявкаНаОбеспечениеТовары.Упаковка КАК Упаковка,
		|	ЗаявкаНаОбеспечениеТовары.КЗаказу КАК КоличествоУпаковок,
		|	ЗаявкаНаОбеспечениеТовары.Ссылка.Склад КАК Склад
		|ИЗ
		|	Документ.ЗаявкаНаОбеспечение.Товары КАК ЗаявкаНаОбеспечениеТовары
		|ГДЕ
		|	ЗаявкаНаОбеспечениеТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ТаблицаТоваровДляЗаказа()
	
Функция РеквизитыДокументаЗаказа(Заявка) экспорт

	      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаОбеспечение.Партнер КАК Партнер,
		|	ЗаявкаНаОбеспечение.Контрагент КАК Контрагент,
		|	ЗаявкаНаОбеспечение.Соглашение КАК Соглашение,
		|	ЗаявкаНаОбеспечение.Договор КАК Договор,
		|	&Ссылка КАК ДокументОснование
		|ИЗ
		|	Документ.ЗаявкаНаОбеспечение КАК ЗаявкаНаОбеспечение
		|ГДЕ
		|	ЗаявкаНаОбеспечение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если  ВыборкаДетальныеЗаписи.Следующий() тогда
		
		   возврат ВыборкаДетальныеЗаписи;
	Конецесли;
	
    Возврат Новый Структура();

КонецФункции // РеквизитыДокументаЗаказа()
	
	
#КонецЕсли
